Revit 2027 API
FamilySizeTableManager.GetFamilySizeTableManager Method
 Gets a FamilySizeTableManager from a Family
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FamilySizeTableManager GetFamilySizeTableManager(
	Document document,
	ElementId familyId
)
Public Shared Function GetFamilySizeTableManager (
	document As Document,
	familyId As ElementId
) As FamilySizeTableManager
public:
static FamilySizeTableManager^ GetFamilySizeTableManager(
	Document^ document,
	ElementId^ familyId
)
static member GetFamilySizeTableManager :
        document : Document *
        familyId : ElementId -> FamilySizeTableManager
Parameters
document Document
 Family owned document or a project document
familyId ElementId
 ElementId of the Family.
Return Value
FamilySizeTableManager
 The FamilySizeTableManager of the Family.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FamilySizeTableManager Class
Autodesk.Revit.DB Namespace